blog_on_rails/app/views/posts/index.html.erb

        </div>
        <%= link_to "#{post.comments.count} comment#{'s' if post.comments.count > 1}", post_path(post.id), class: "comments-link" %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 78]]