blog_on_rails_with_authority/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "This is a Test"], ["body", "Look at this wonderful test which is acting as my body!"], ["created_at", "2018-02-14 07:47:05.151557"], ["updated_at", "2018-02-14 07:47:05.151557"]]
---
  def create
    @post = Post.new post_params
    @post.user = current_user

    if @post.save

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC, "posts"."desc" ASC
---
  def index
    @posts = Post.order(created_at: :desc)

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC, "comments"."desc" ASC  [["post_id", 78]]
---
  def show
    @comment = Comment.new
    @comments = Post.find(params[:id]).comments.order(created_at: :desc)

UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "This is a Test Blah Blah"], ["updated_at", "2018-02-14 07:48:34.642606"], ["id", 51]]
---
  def update
    if @post.update post_params

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
---
  def find_post
    @post = Post.find params[:id]