blog_on_rails_with_authority/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new user_params

    if @user.save

UPDATE "users" SET "first_name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["first_name", "Lizeth-changed"], ["updated_at", "2018-02-20 05:28:16.139043"], ["id", 39]]
---
  def update
    if @user.update user_params

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$10$dbAP9OIvO3Lt/Nd6eJqpp.duaR1ZVqNU0RHsFgdaANtiqiXYs8/5S"], ["updated_at", "2018-02-20 01:08:19.170493"], ["id", 3]]
---
  def update_pass
    passwords = passwords_params

    if @user.authenticate(passwords[:current_password])
      if passwords[:current_password] == passwords[:password]
        flash[:alert] = "New password cannot be the same as current password"
      elsif passwords[:password].length < 6
        flash[:alert] = "Password needs to be at least 6 characters"
      elsif @user.update password: passwords[:password], password_confirmation: passwords[:password_confirmation]

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def find_user
    @user = User.find params[:id]