blog_on_rails_with_authority/app/views/posts/show.html.erb

</div>
<small>Posted <%= time_ago_in_words(@post.created_at) %> ago by <strong><%= @post.user.first_name %> <%= @post.user.last_name %></strong></small><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]