blog_on_rails/app/controllers/comments_controller.rb

  def create
    @post = Post.find params[:post_id]
    @comment = Comment.new comment_params
    @comment.post = @post

    if @comment.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 78], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "This is a test"], ["post_id", 78], ["created_at", "2018-02-14 08:26:59.715207"], ["updated_at", "2018-02-14 08:26:59.715207"]]

  def destroy
    comment = Comment.find params[:id]
    comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 154], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 154]]