blog_on_rails/app/controllers/posts_controller.rb

  def create
    @post = Post.new post_params

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "This is a Test"], ["body", "Look at this wonderful test which is acting as my body!"], ["created_at", "2018-02-14 07:47:05.151557"], ["updated_at", "2018-02-14 07:47:05.151557"]]

  def index
    @posts = Post.order(created_at: :desc)
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" ASC, "posts"."desc" ASC

  def show
    @post = Post.find params[:id]
    @comment = Comment.new
    @comments = Post.find(params[:id]).comments.order(created_at: :desc)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1 ORDER BY "comments"."created_at" ASC, "comments"."desc" ASC  [["post_id", 78]]

  def edit
    @post = Post.find params[:id]
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]

  def update
    @post = Post.find params[:id]

    if @post.update post_params
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["title", "This is a Test Blah Blah"], ["updated_at", "2018-02-14 07:48:34.642606"], ["id", 51]]

  def destroy
    @post = Post.find params[:id]
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 50], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 50]]